import card_1 from "@/shared/assests/history_1.png";
import card_2 from "@/shared/assests/history_2.png";

export const list = [
    {
        title: "Статьи",
        listHref: [
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
        ],
        image: card_1.src,
    },
    {
        title: "Новости",
        image: card_2.src,
        listHref: [
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
        ],
    },
    {
        title: "Закон о рекламе",
        image: card_2.src,
        description:
            "Подведение итогов пилотного тестирования сервиса для нетворкинга. Подведение итогов пилотного тестирования сервиса для нетворкинга. Подведение итогов пилотного тестирования сервиса для нетворкинга",
    },
];

export const listQuestions = [
    "Как долго длятся курсы?",
    "Что я получу?",
    "Подойдут ли мне эти курсы?",
    "Есть рассрочка?",
];
