import card_3 from "@/shared/assests/ImageP_3.png";
import card_4 from "@/shared/assests/ImageP_4.png";
import card_5 from "@/shared/assests/ImageP_5.png";

export const list = [
    {
        title: "Статьи",
        listHref: [
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
        ],
        image: card_3.src,
    },
    {
        title: "Новости",
        image: card_4.src,
        listHref: [
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
            { title: "Подведение итогов пилотного тестирования сервиса для нетворкинга", href: "/" },
        ],
    },
    {
        title: "Закон о рекламе",
        image: card_5.src,
        description:
            "Подведение итогов пилотного тестирования сервиса для нетворкинга. Подведение итогов пилотного тестирования сервиса для нетворкинга. Подведение итогов пилотного тестирования сервиса для нетворкинга",
    },
];

export const listQuestions = [
    "Как долго длятся курсы?",
    "Что я получу?",
    "Подойдут ли мне эти курсы?",
    "Есть рассрочка?",
];
