import cnBind from "classnames/bind";
import { useFormik } from "formik";

import { Modal } from "@/components/_Modals/Modal";
import { useResizeContext } from "@/shared/context/WindowResizeProvider";
import { Button } from "@/shared/ui/Button";
import { CheckBox } from "@/shared/ui/CheckBox";
import { TextField } from "@/shared/ui/TextField";

import styles from "./ModalFeedBack.module.scss";

const cx = cnBind.bind(styles);
type Props = {
    isOpen: boolean;
    onClose: () => void;
};
export const ModalFeedBack = ({ isOpen, onClose }: Props) => {
    const { isMobile } = useResizeContext();

    const formik = useFormik({
        initialValues: {
            name: "",
            phone: "",
            policy: false,
        },
        onSubmit: (values) => {
            console.log(values);
        },
    });

    return (
        <Modal className={cx("modal-feedback", { isMobile })} maxWidth="880px" onClose={onClose} isOpen={isOpen}>
            <div className={cx("decor", { isMobile })}>
                <div className={cx("header")}>
                    <h2 className={cx("title")}>Размещение рекламы и привлечение клиентов</h2>
                    <svg
                        onClick={onClose}
                        width="40"
                        height="40"
                        viewBox="0 0 40 40"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                        className={cx("close")}
                    >
                        <rect width="40" height="40" rx="20" fill="#F7F7FF" />
                        <path
                            d="M26.3002 13.7107C25.9102 13.3207 25.2802 13.3207 24.8902 13.7107L20.0002 18.5907L15.1102 13.7007C14.7202 13.3107 14.0902 13.3107 13.7002 13.7007C13.3102 14.0907 13.3102 14.7207 13.7002 15.1107L18.5902 20.0007L13.7002 24.8907C13.3102 25.2807 13.3102 25.9107 13.7002 26.3007C14.0902 26.6907 14.7202 26.6907 15.1102 26.3007L20.0002 21.4107L24.8902 26.3007C25.2802 26.6907 25.9102 26.6907 26.3002 26.3007C26.6902 25.9107 26.6902 25.2807 26.3002 24.8907L21.4102 20.0007L26.3002 15.1107C26.6802 14.7307 26.6802 14.0907 26.3002 13.7107Z"
                            fill="#040F16"
                        />
                    </svg>
                </div>
                <form className={cx("form")} onSubmit={formik.handleSubmit}>
                    <h2>Оставьте заявку</h2>
                    <div className={cx("form-content")}>
                        <div className={cx("inputs")}>
                            <TextField
                                value={formik.values.name}
                                onChange={formik.handleChange}
                                name="name"
                                placeholder="Имя"
                                mode="light"
                            />
                            <TextField
                                value={formik.values.phone}
                                onChange={formik.handleChange}
                                name="phone"
                                placeholder="Номер телефона*"
                                mode="light"
                            />
                        </div>

                        <Button className={cx("button")} label="Отправить заявку" type="submit" />
                    </div>

                    <div className={cx("footer")}>
                        <CheckBox
                            checked={formik.values.policy}
                            onChange={formik.handleChange}
                            name="policy"
                            title="Согласен(а) на обработку персональных данных"
                        />
                        <div className={cx("social")}>
                            <div className={cx("social-item", "icon")}>
                                <svg
                                    width="24"
                                    height="24"
                                    viewBox="0 0 24 24"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <g clip-path="url(#clip0_4489_2832)">
                                        <path
                                            d="M24 12C24 5.37258 18.6274 0 12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12Z"
                                            fill="#419FD9"
                                        />
                                        <path
                                            d="M24 12C24 5.37258 18.6274 0 12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12Z"
                                            fill="url(#paint0_linear_4489_2832)"
                                        />
                                        <path
                                            d="M5.3937 11.7354C8.88335 10.1831 11.2103 9.15973 12.3747 8.66523C15.699 7.25348 16.3898 7.00823 16.84 7.00008C16.939 6.99838 17.1604 7.02343 17.3039 7.14223C17.425 7.24258 17.4583 7.37813 17.4742 7.47323C17.4901 7.56838 17.51 7.78508 17.4942 7.95438C17.3141 9.88698 16.5346 14.5769 16.138 16.7415C15.9702 17.6574 15.6398 17.9645 15.32 17.9945C14.6248 18.0598 14.0969 17.5255 13.4236 17.0748C12.37 16.3697 11.7749 15.9307 10.7522 15.2427C9.57035 14.4475 10.3365 14.0104 11.01 13.2961C11.1863 13.1092 14.2492 10.2647 14.3084 10.0067C14.3159 9.97443 14.3228 9.85413 14.2528 9.79063C14.1828 9.72713 14.0795 9.74883 14.0049 9.76608C13.8993 9.79058 12.2162 10.9264 8.95565 13.1736C8.4779 13.5086 8.0452 13.6717 7.6575 13.6632C7.2301 13.6538 6.40795 13.4165 5.79675 13.2136C5.0471 12.9648 4.45127 12.8333 4.50315 12.4107C4.53017 12.1906 4.82701 11.9655 5.3937 11.7354Z"
                                            fill="white"
                                        />
                                    </g>
                                    <defs>
                                        <linearGradient
                                            id="paint0_linear_4489_2832"
                                            x1="12"
                                            y1="0"
                                            x2="12"
                                            gradientUnits="userSpaceOnUse"
                                        >
                                            <stop stop-color="#2AABEE" />
                                            <stop offset="1" stop-color="#229ED9" />
                                        </linearGradient>
                                        <clipPath id="clip0_4489_2832">
                                            <rect width="24" height="24" fill="white" />
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                            <div className={cx("social-item", "icon")}>
                                <svg
                                    width="24"
                                    height="24"
                                    viewBox="0 0 24 24"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <g clip-path="url(#clip0_4489_2838)">
                                        <path
                                            d="M20.5019 3.48769C18.2457 1.23993 15.2457 0.00137141 12.0494 0C5.46299 0 0.102956 5.33475 0.100319 11.8919C0.0995518 13.9879 0.649635 16.034 1.6952 17.8375L0 24L6.33436 22.3464C8.0796 23.294 10.0446 23.7933 12.0443 23.7941H12.0494H12.0494C18.6348 23.7941 23.9957 18.4584 23.9984 11.9016C23.9995 8.72364 22.7577 5.73561 20.5019 3.48769ZM12.0494 21.7855H12.0456C10.2631 21.7846 8.51525 21.3081 6.99067 20.4075L6.62784 20.1933L2.8689 21.1745L3.87249 17.527L3.63609 17.1531C2.64185 15.5792 2.11698 13.7603 2.11772 11.8927C2.11991 6.44257 6.57497 2.00867 12.0532 2.00867C14.706 2.00976 17.1994 3.03926 19.0746 4.90753C20.9497 6.77579 21.9817 9.25937 21.9809 11.9007C21.9785 17.351 17.5233 21.7855 12.0494 21.7855Z"
                                            fill="#E0E0E0"
                                        />
                                        <path
                                            d="M0.548828 23.3172L2.16659 17.4362C1.16853 15.7151 0.643677 13.7624 0.644307 11.7625C0.646924 5.50497 5.76216 0.414062 12.0472 0.414062C15.0976 0.415434 17.9606 1.59735 20.1132 3.7425C22.2663 5.88762 23.4513 8.73896 23.4501 11.7714C23.4474 18.029 18.3319 23.1204 12.0476 23.1204C12.0472 23.1204 12.048 23.1204 12.0476 23.1204H12.0426C10.1342 23.1198 8.25913 22.6428 6.59372 21.7392L0.548828 23.3172Z"
                                            fill="url(#paint0_linear_4489_2838)"
                                        />
                                        <path
                                            fill-rule="evenodd"
                                            clip-rule="evenodd"
                                            d="M9.09668 6.84272C8.87561 6.35338 8.64286 6.34359 8.43254 6.33503C8.26051 6.32768 8.06357 6.32813 7.86695 6.32813C7.67017 6.32813 7.3504 6.40176 7.07998 6.69579C6.8094 6.98982 6.04688 7.70062 6.04688 9.14626C6.04688 10.5921 7.10458 11.989 7.25201 12.1852C7.39959 12.3812 9.29377 15.4427 12.2936 16.6204C14.7867 17.5993 15.2941 17.4046 15.8352 17.3556C16.3764 17.3066 17.5813 16.6449 17.8273 15.9588C18.0733 15.2727 18.0733 14.6847 17.9995 14.5618C17.9257 14.4393 17.7289 14.3659 17.4338 14.2189C17.1386 14.072 15.6876 13.361 15.4171 13.2631C15.1465 13.1651 14.9497 13.1161 14.7529 13.4103C14.5561 13.7042 13.9909 14.3659 13.8187 14.5618C13.6465 14.7582 13.4743 14.7826 13.1791 14.6357C12.884 14.4883 11.9334 14.1784 10.8058 13.1773C9.92839 12.3986 9.33604 11.4368 9.16386 11.1426C8.99167 10.8487 9.1454 10.6895 9.29346 10.543C9.42597 10.4114 9.58863 10.2 9.73622 10.0285C9.88349 9.85687 9.93268 9.73442 10.0311 9.5385C10.1295 9.34228 10.0803 9.17071 10.0065 9.02377C9.93268 8.87684 9.3591 7.42373 9.09668 6.84272Z"
                                            fill="white"
                                        />
                                        <path
                                            d="M20.4052 3.45157C18.1749 1.22961 15.2094 0.00529725 12.0498 0.00390625C5.53895 0.00390625 0.240447 5.27741 0.23783 11.7593C0.237063 13.8313 0.780829 15.8538 1.81439 17.6366L0.138672 23.7284L6.40032 22.0937C8.12555 23.0304 10.068 23.524 12.0447 23.5248H12.0497H12.0498C18.5596 23.5248 23.8588 18.2504 23.8616 11.7688C23.8627 8.62741 22.6351 5.67369 20.4052 3.45157ZM12.0498 21.5393H12.046C10.284 21.5384 8.55616 21.0675 7.04909 20.1771L6.69042 19.9654L2.97463 20.9354L3.96669 17.3298L3.73301 16.9601C2.75018 15.4043 2.23133 13.6063 2.23209 11.7601C2.23424 6.37256 6.63815 1.98955 12.0535 1.98955C14.6759 1.99063 17.1406 3.00831 18.9944 4.85513C20.848 6.70195 21.868 9.15701 21.8672 11.7681C21.8649 17.1557 17.4608 21.5393 12.0498 21.5393Z"
                                            fill="white"
                                        />
                                    </g>
                                    <defs>
                                        <linearGradient
                                            id="paint0_linear_4489_2838"
                                            x1="11.9995"
                                            y1="23.3172"
                                            x2="11.9995"
                                            y2="0.414101"
                                            gradientUnits="userSpaceOnUse"
                                        >
                                            <stop stop-color="#20B038" />
                                            <stop offset="1" stop-color="#60D66A" />
                                        </linearGradient>
                                        <clipPath id="clip0_4489_2838">
                                            <rect width="24" height="24" fill="white" />
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                        </div>
                    </div>
                </form>
            </div>
        </Modal>
    );
};
